#### CreateCreasesFromFoldingLines Method

---

|  |
| --- |
| SlabShapeEditor Class   See Also |

Convert selected folding lines to split lines

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2023

# Syntax

| C# |
| --- |
| ``` public void CreateCreasesFromFoldingLines( 	Element hostObj, 	IList<Reference> references ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub CreateCreasesFromFoldingLines ( _ 	hostObj As Element, _ 	references As IList(Of Reference) _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void CreateCreasesFromFoldingLines( 	Element^ hostObj,  	IList<Reference^>^ references ) ``` |

#### Parameters

hostObj
:   Type:  Autodesk.Revit.DB Element
     object that hosts the SlabShapeEditor

references
:   Type:  System.Collections.Generic IList   Reference
     References of selected folding lines.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions InvalidOperationException | this operation failed. |

# See Also

SlabShapeEditor Class

Autodesk.Revit.DB Namespace